# IsValidForSaveToProjectAsImage Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions..::..IsValidForSaveToProjectAsImage Method
ImageExportOptions Class See Also
---
Verify if ImageExportOptions object is valid for calling saveToProjectAsImage
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool IsValidForSaveToProjectAsImage(
	ImageExportOptions options,
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function IsValidForSaveToProjectAsImage ( _
	options As ImageExportOptions, _
	doc As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidForSaveToProjectAsImage(
	ImageExportOptions^ options,
	Document^ doc
)
```

# ### Parameters
options
    Type: Autodesk.Revit.DB..::..ImageExportOptions ImageExportOptions object to be validated
doc
    Type: Autodesk.Revit.DB..::..Document Document for view name verification
# ### Return Value
True if ImageExportOptions object is valid for calling saveToProjectAsImage; false otherwise
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace